In [1]:
import mysql.connector
import pandas as pd

import warnings
warnings.filterwarnings("ignore", category=DeprecationWarning)
warnings.filterwarnings('ignore')

In [2]:
from mysql.connector import connect
from getpass import getpass

In [3]:
db = connect(
        host= "localhost",
        user = "root",
        passwd = getpass("Enter password: "),
        database= "sakila"
   )

Enter password: ········

In [38]:
cursor = db.cursor()

In [39]:
rentals_may = "select count(*), customer_id from rentals_may group by customer_id"

In [43]:
df_may = pd.read_sql_query(rentals_may,db)

In [46]:
df_may.head(5)

   count(*)  customer_id
0         2          130
1         1          459
2         3          408
3         1          333
4         4          222

In [61]:
df_may['count(*)'].sum()

993

#### Dataframe for SQL query (June Rentals)

In [34]:
rentals_june = "select count(*), customer_id from rentals_june group by customer_id"

In [47]:
df_june = pd.read_sql_query(rentals_june,db)
df.head(5)

   count(*)  customer_id
0         5          416
1         6          516
2         5          239
3         3          285
4         6          310

In [60]:
#df_june.columns
df_june['count(*)'].sum()

2311

#### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [101]:
#Write a function that checks if customer borrowed more or less films in the month 
#of June as compared to May.

df_rentals_may = df_may['count(*)'].sum()
df_rentals_june = df_june['count(*)'].sum()

def rentals(x,y):
    if x > y:
        print ("Customer borrowed more movies in May")
    else:
        print ("Customer borrowed more movies in June") 
   
rentals(df_rentals_may, df_rentals_june)

Customer borrowed more movies in June